In [1]:
#Importa os pacotes
import pandas as pd
import numpy as np
import os

**1.Carregar dataset com os dados tratados e mesclados**

In [2]:
caminho_arquivo_tratado = "./v2/historico_precos_com_regioes.zip"
df = pd.read_csv(caminho_arquivo_tratado, parse_dates=["Data_Coleta"])
df.head()

      Produto Data_Coleta  Valor_Venda_Litro_Em_Reais   Nome_Regiao Municipio
0  DIESEL S10  2016-02-01                       3.237  Sul de Minas   ALFENAS
1  DIESEL S10  2016-05-02                       3.237  Sul de Minas   ALFENAS
2  DIESEL S10  2016-01-04                       3.197  Sul de Minas   ALFENAS
3  DIESEL S10  2016-04-04                       3.237  Sul de Minas   ALFENAS
4  DIESEL S10  2016-06-06                       3.209  Sul de Minas   ALFENAS

**2.Resumo do dataframe**

In [3]:
df.describe(include="all")

,Produto,Data_Coleta,Valor_Venda_Litro_Em_Reais,Nome_Regiao,Municipio
count,465446,465446,465446.000000,465446,465446
unique,5,1003,NaN,10,64
top,ETANOL,2020-08-17 00:00:00,NaN,Central,UBERLÂNDIA
freq,137751,1668,NaN,130484,27349
first,NaN,2016-01-04 00:00:00,NaN,NaN,NaN
last,NaN,2021-01-27 00:00:00,NaN,NaN,NaN
mean,NaN,NaN,3.542522,NaN,NaN
std,NaN,NaN,0.649963,NaN,NaN
min,NaN,NaN,1.999000,NaN,NaN
25%,NaN,NaN,3.040000,NaN,NaN
50%,NaN,NaN,3.449000,NaN,NaN
75%,NaN,NaN,3.896000,NaN,NaN
max,NaN,NaN,5.799000,NaN,NaN

**3.Media historica de Preços**

In [4]:
df.loc[:,"Valor_Venda_Litro_Em_Reais"]

0         3.237
1         3.237
2         3.197
3         3.237
4         3.209
          ...
465441    4.750
465442    4.997
465443    4.997
465444    4.699
465445    4.539
Name: Valor_Venda_Litro_Em_Reais, Length: 465446, dtype: float64